benspaulding.python-manifest-template
dbaeumer.vscode-eslint
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
esbenp.prettier-vscode
github.copilot
github.copilot-chat
github.vscode-github-actions
hashicorp.terraform
jeff-hykin.better-cpp-syntax
kdarkhan.mips
kevinrose.vsc-python-indent
markwhen.markwhen
mcagampan.dark-horizon
ms-playwright.playwright
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.makefile-tools
ms-vscode.remote-explorer
mshr-h.veriloghdl
njpwerner.autodocstring
pkief.material-icon-theme
redhat.ansible
redhat.vscode-yaml
robbowen.synthwave-vscode
rust-lang.rust-analyzer
samuelcolvin.jinjahtml
shd101wyy.markdown-preview-enhanced
stylelint.vscode-stylelint
svelte.svelte-vscode
tamasfe.even-better-toml
tauri-apps.tauri-vscode
tcwalther.cython
teros-technology.teroshdl
twxs.cmake
viktorqvarfordt.vscode-pitch-black-theme
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
wayou.vscode-todo-highlight
wholroyd.jinja
yzhang.markdown-all-in-one
ziglang.vscode-zig
